### Regression Project

In [1]:
import pyodbc #just installed with pip
from dotenv import dotenv_values #import the dotenv_values function from the dotenv package
import pandas as pd 
import warnings 
warnings.filterwarnings('ignore')

In [2]:
# Load environment variables from .env file into a dictionary
environment_variables=dotenv_values('.env')# Get the values for the credentials you set in the '.env' file
database=environment_variables.get("DATABASE")
server=environment_variables.get("SERVER")
username=environment_variables.get("USERNAME")
password=environment_variables.get("PASSWORD")

connection_string=f"DRIVER={{SQL Server}};SERVER={server};DATABASE={database};UID={username};PWD={password}"

In [3]:
# Use the connect method of the pyodbc library and pass in the connection string.
# This will connect to the server and might take a few seconds to be complete. 
# Check your internet connection if it takes more time than necessary

connection=pyodbc.connect(connection_string)

In [4]:
# Now the sql queries to get the data is what what you see below. 
# Note that you will not have permissions to insert delete or update this database table. 

query_1 = "Select * from dbo.oil"
query_2 = "Select * from dbo.holidays_events"
query_3 = "Select * from dbo.stores"

data_oil = pd.read_sql(query_1,connection)
holiday_data = pd.read_sql(query_2,connection)
store_data = pd.read_sql(query_3,connection)

In [5]:
#prima facie view of data_1 concerning daily oil prices
data_oil

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02   93.139999
2     2013-01-03   92.970001
3     2013-01-04   93.120003
4     2013-01-07   93.199997
...          ...         ...
1213  2017-08-25   47.650002
1214  2017-08-28   46.400002
1215  2017-08-29   46.459999
1216  2017-08-30   45.959999
1217  2017-08-31   47.259998

[1218 rows x 2 columns]

In [6]:
# Convert string dates to datetime objects
data_oil['date'] = pd.to_datetime(data_oil['date'])

In [7]:
# preview of first five rows of each dataframe using .head() method
#data_oil
data_oil.head()

        date  dcoilwtico
0 2013-01-01         NaN
1 2013-01-02   93.139999
2 2013-01-03   92.970001
3 2013-01-04   93.120003
4 2013-01-07   93.199997

In [8]:
#holiday_data
holiday_data.head()

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [9]:
# Convert string dates to datetime objects
holiday_data['date'] = pd.to_datetime(holiday_data['date'])

In [10]:
#store_data
store_data.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [11]:
#preview of information summary in the dataframes usind .info() method
#data_oil
data_oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   datetime64[ns]
 1   dcoilwtico  1175 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 19.2 KB

In [12]:
#Check of missing values in Daily Oil Prices data
data_oil.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [13]:
# data_2
holiday_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         350 non-null    datetime64[ns]
 1   type         350 non-null    object
 2   locale       350 non-null    object
 3   locale_name  350 non-null    object
 4   description  350 non-null    object
 5   transferred  350 non-null    bool
dtypes: bool(1), datetime64[ns](1), object(4)
memory usage: 14.1+ KB

In [14]:
#Check of missing values in Holiday data
holiday_data.isna().sum()

date           0
type           0
locale         0
locale_name    0
description    0
transferred    0
dtype: int64

In [15]:
# data_3
store_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   store_nbr  54 non-null     int64
 1   city       54 non-null     object
 2   state      54 non-null     object
 3   type       54 non-null     object
 4   cluster    54 non-null     int64
dtypes: int64(2), object(3)
memory usage: 2.2+ KB

In [16]:
#Check of missing values in store_data
store_data.isna().sum()

store_nbr    0
city         0
state        0
type         0
cluster      0
dtype: int64

In [17]:
#transaction data
transaction_data = pd.read_csv(r"C:\Users\WORLDAX COMPUTERS\Python Projects\LP3_DAP_Project\LP3-Regression-Project\Datasets\transactions.csv", index_col=None)
transaction_data

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [18]:
# Convert string dates to datetime objects in transaction_data 
transaction_data['date'] = pd.to_datetime(transaction_data['date'])

#Preview of information summary in the transaction data
transaction_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  datetime64[ns]
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 1.9 MB

In [19]:
#Any missing values in the transaction_data dataframe
transaction_data.isna().sum()

date            0
store_nbr       0
transactions    0
dtype: int64

In [20]:
#Loading of Train data set
train_data = pd.read_csv(r"C:\Users\WORLDAX COMPUTERS\Python Projects\LP3_DAP_Project\LP3-Regression-Project\Datasets\train.csv", index_col=None)
train_data

,id,date,store_nbr,family,sales,onpromotion
0,0,2013-01-01,1,AUTOMOTIVE,0.000,0
1,1,2013-01-01,1,BABY CARE,0.000,0
2,2,2013-01-01,1,BEAUTY,0.000,0
3,3,2013-01-01,1,BEVERAGES,0.000,0
4,4,2013-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
3000883,3000883,2017-08-15,9,POULTRY,438.133,0
3000884,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
3000885,3000885,2017-08-15,9,PRODUCE,2419.729,148
3000886,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
3000887,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [21]:
# Convert string dates to datetime objects in train set
train_data['date'] = pd.to_datetime(train_data['date'])

In [22]:
#Train set columns
train_data.columns

Index(['id', 'date', 'store_nbr', 'family', 'sales', 'onpromotion'], dtype='object')

In [23]:
#Preview of information summary in train data
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000888 entries, 0 to 3000887
Data columns (total 6 columns):
 #   Column       Dtype
---  ------       -----
 0   id           int64
 1   date         datetime64[ns]
 2   store_nbr    int64
 3   family       object
 4   sales        float64
 5   onpromotion  int64
dtypes: datetime64[ns](1), float64(1), int64(3), object(1)
memory usage: 137.4+ MB

In [24]:
#Check of missing values in train data
train_data.isna().sum()

id             0
date           0
store_nbr      0
family         0
sales          0
onpromotion    0
dtype: int64

In [25]:
#Loading of test data set
test_data = pd.read_csv(r"C:\Users\WORLDAX COMPUTERS\Python Projects\LP3_DAP_Project\LP3-Regression-Project\Datasets\test.csv", index_col=None)
test_data

            id        date  store_nbr                      family  onpromotion
0      3000888  2017-08-16          1                  AUTOMOTIVE            0
1      3000889  2017-08-16          1                   BABY CARE            0
2      3000890  2017-08-16          1                      BEAUTY            2
3      3000891  2017-08-16          1                   BEVERAGES           20
4      3000892  2017-08-16          1                       BOOKS            0
...        ...         ...        ...                         ...          ...
28507  3029395  2017-08-31          9                     POULTRY            1
28508  3029396  2017-08-31          9              PREPARED FOODS            0
28509  3029397  2017-08-31          9                     PRODUCE            1
28510  3029398  2017-08-31          9  SCHOOL AND OFFICE SUPPLIES            9
28511  3029399  2017-08-31          9                     SEAFOOD            0

[28512 rows x 5 columns]

In [26]:
# Convert string dates to datetime objects in test data set
test_data['date'] = pd.to_datetime(test_data['date'])

In [27]:
#Preview of information summary in test data
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28512 entries, 0 to 28511
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           28512 non-null  int64
 1   date         28512 non-null  datetime64[ns]
 2   store_nbr    28512 non-null  int64
 3   family       28512 non-null  object
 4   onpromotion  28512 non-null  int64
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 1.1+ MB

In [28]:
#Check of missing values in test data
test_data.isna().sum()

id             0
date           0
store_nbr      0
family         0
onpromotion    0
dtype: int64

## Cleaning

Ecuador is an oil-dependent country and its economical health is highly vulnerable to shocks in oil prices

Slice of data from Date 2013-01-01 to 2013-01-07 in oil.csv(Daily oil price) 

Addition of the sliced oil prices data to the training set because they fall within same timeframe

In [29]:
start_date = pd.to_datetime('2013-01-01')

end_date = pd.to_datetime('2017-08-15')

#Use of Boolean indexing to slice data within the data range
sliced_df1 =data_oil[(data_oil['date'] >= start_date) & (data_oil['date'] <= end_date)]

sliced_df1

           date  dcoilwtico
0    2013-01-01         NaN
1    2013-01-02   93.139999
2    2013-01-03   92.970001
3    2013-01-04   93.120003
4    2013-01-07   93.199997
...         ...         ...
1201 2017-08-09   49.590000
1202 2017-08-10   48.540001
1203 2017-08-11   48.810001
1204 2017-08-14   47.590000
1205 2017-08-15   47.570000

[1206 rows x 2 columns]

Concatanation of sliced_df_1 to the training data set

In [30]:
# Merge the two DataFrames based on the 'date' column
#The how='left' argument specifies that you want to keep all rows from the left DataFrame (train_data), 
#and match them with rows from the right DataFrame (sliced_df1) based on the 'date' column.

merged_train_data = train_data.merge(sliced_df1, on='date', how='left')

#preview of merged train data
merged_train_data.tail(10)

,id,date,store_nbr,family,sales,onpromotion,dcoilwtico
3000878,3000878,2017-08-15,9,MAGAZINES,11.000,0,47.57
3000879,3000879,2017-08-15,9,MEATS,449.228,0,47.57
3000880,3000880,2017-08-15,9,PERSONAL CARE,522.000,11,47.57
3000881,3000881,2017-08-15,9,PET SUPPLIES,6.000,0,47.57
3000882,3000882,2017-08-15,9,PLAYERS AND ELECTRONICS,6.000,0,47.57
3000883,3000883,2017-08-15,9,POULTRY,438.133,0,47.57
3000884,3000884,2017-08-15,9,PREPARED FOODS,154.553,1,47.57
3000885,3000885,2017-08-15,9,PRODUCE,2419.729,148,47.57
3000886,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8,47.57
3000887,3000887,2017-08-15,9,SEAFOOD,16.000,0,47.57

In [31]:
merged_train_data.columns

Index(['id', 'date', 'store_nbr', 'family', 'sales', 'onpromotion',
       'dcoilwtico'],
      dtype='object')

Addition of store.csv medata and transaction data to both the training and testing data

Merging will be based on the similar column in the dataframes

Merging of store.csv with train_data based on column 'store number'

In [32]:
#Check of unique values in store number column of merged_train_data
merged_train_data['store_nbr'].unique()

array([ 1, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19,  2, 20, 21, 22, 23, 24,
       25, 26, 27, 28, 29,  3, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39,  4,
       40, 41, 42, 43, 44, 45, 46, 47, 48, 49,  5, 50, 51, 52, 53, 54,  6,
        7,  8,  9], dtype=int64)

In [33]:
# check of  unique values in store number column of store dataframe
store_data['store_nbr'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54], dtype=int64)

In [34]:
# Merge the two DataFrames based on the 'store number' column
merged_train_data2 = merged_train_data.merge(store_data, on='store_nbr', how='left')

#preview of the merged train data
merged_train_data2.tail(10)

,id,date,store_nbr,family,sales,onpromotion,dcoilwtico,city,state,type,cluster
3000878,3000878,2017-08-15,9,MAGAZINES,11.000,0,47.57,Quito,Pichincha,B,6
3000879,3000879,2017-08-15,9,MEATS,449.228,0,47.57,Quito,Pichincha,B,6
3000880,3000880,2017-08-15,9,PERSONAL CARE,522.000,11,47.57,Quito,Pichincha,B,6
3000881,3000881,2017-08-15,9,PET SUPPLIES,6.000,0,47.57,Quito,Pichincha,B,6
3000882,3000882,2017-08-15,9,PLAYERS AND ELECTRONICS,6.000,0,47.57,Quito,Pichincha,B,6
3000883,3000883,2017-08-15,9,POULTRY,438.133,0,47.57,Quito,Pichincha,B,6
3000884,3000884,2017-08-15,9,PREPARED FOODS,154.553,1,47.57,Quito,Pichincha,B,6
3000885,3000885,2017-08-15,9,PRODUCE,2419.729,148,47.57,Quito,Pichincha,B,6
3000886,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8,47.57,Quito,Pichincha,B,6
3000887,3000887,2017-08-15,9,SEAFOOD,16.000,0,47.57,Quito,Pichincha,B,6

Merging of transaction data to the training set based on two similar columns, namely, 'date', and 'store_nbr'

In [35]:
merged_train_dataset = merged_train_data2.merge(transaction_data, on=['date', 'store_nbr'], how='left')

#Preview of changes made to training data
merged_train_dataset.tail(10)

,id,date,store_nbr,family,sales,onpromotion,dcoilwtico,city,state,type,cluster,transactions
3000878,3000878,2017-08-15,9,MAGAZINES,11.000,0,47.57,Quito,Pichincha,B,6,2155.0
3000879,3000879,2017-08-15,9,MEATS,449.228,0,47.57,Quito,Pichincha,B,6,2155.0
3000880,3000880,2017-08-15,9,PERSONAL CARE,522.000,11,47.57,Quito,Pichincha,B,6,2155.0
3000881,3000881,2017-08-15,9,PET SUPPLIES,6.000,0,47.57,Quito,Pichincha,B,6,2155.0
3000882,3000882,2017-08-15,9,PLAYERS AND ELECTRONICS,6.000,0,47.57,Quito,Pichincha,B,6,2155.0
3000883,3000883,2017-08-15,9,POULTRY,438.133,0,47.57,Quito,Pichincha,B,6,2155.0
3000884,3000884,2017-08-15,9,PREPARED FOODS,154.553,1,47.57,Quito,Pichincha,B,6,2155.0
3000885,3000885,2017-08-15,9,PRODUCE,2419.729,148,47.57,Quito,Pichincha,B,6,2155.0
3000886,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8,47.57,Quito,Pichincha,B,6,2155.0
3000887,3000887,2017-08-15,9,SEAFOOD,16.000,0,47.57,Quito,Pichincha,B,6,2155.0

Similar changes will be made to the test dataset as were done to train set

Slice of data from Date 2017-08-16 to 2017-08-31 in oil.csv(Daily oil price) 

Addition of the sliced oil prices data to the test set because they fall within same timeframe

In [36]:
start_date1 = pd.to_datetime('2017-08-16')

end_date1 = pd.to_datetime('2017-08-31')

#Use of Boolean indexing to slice data within the data range
sliced_df2 =data_oil[(data_oil['date'] >= start_date1) & (data_oil['date'] <= end_date1)]

#Preview of sliced data
sliced_df2

           date  dcoilwtico
1206 2017-08-16   46.799999
1207 2017-08-17   47.070000
1208 2017-08-18   48.590000
1209 2017-08-21   47.389999
1210 2017-08-22   47.650002
1211 2017-08-23   48.450001
1212 2017-08-24   47.240002
1213 2017-08-25   47.650002
1214 2017-08-28   46.400002
1215 2017-08-29   46.459999
1216 2017-08-30   45.959999
1217 2017-08-31   47.259998

Concatanation of sliced_df2 to the test data set

In [37]:
# Merge the two DataFrames based on the 'date' column
merged_test_data = test_data.merge(sliced_df2, on='date', how='left')

#preview of merged train data
merged_test_data.tail(10)

,id,date,store_nbr,family,onpromotion,dcoilwtico
28502,3029390,2017-08-31,9,MAGAZINES,0,47.259998
28503,3029391,2017-08-31,9,MEATS,20,47.259998
28504,3029392,2017-08-31,9,PERSONAL CARE,14,47.259998
28505,3029393,2017-08-31,9,PET SUPPLIES,0,47.259998
28506,3029394,2017-08-31,9,PLAYERS AND ELECTRONICS,0,47.259998
28507,3029395,2017-08-31,9,POULTRY,1,47.259998
28508,3029396,2017-08-31,9,PREPARED FOODS,0,47.259998
28509,3029397,2017-08-31,9,PRODUCE,1,47.259998
28510,3029398,2017-08-31,9,SCHOOL AND OFFICE SUPPLIES,9,47.259998
28511,3029399,2017-08-31,9,SEAFOOD,0,47.259998

In [38]:
# Merging of store.csv data with the test_data based on column 'store number'
# Merge the two DataFrames based on the 'store number' column
merged_test_data2 = merged_test_data.merge(store_data, on='store_nbr', how='left')

#preview of the merged train data
merged_test_data2.tail(10)

,id,date,store_nbr,family,onpromotion,dcoilwtico,city,state,type,cluster
28502,3029390,2017-08-31,9,MAGAZINES,0,47.259998,Quito,Pichincha,B,6
28503,3029391,2017-08-31,9,MEATS,20,47.259998,Quito,Pichincha,B,6
28504,3029392,2017-08-31,9,PERSONAL CARE,14,47.259998,Quito,Pichincha,B,6
28505,3029393,2017-08-31,9,PET SUPPLIES,0,47.259998,Quito,Pichincha,B,6
28506,3029394,2017-08-31,9,PLAYERS AND ELECTRONICS,0,47.259998,Quito,Pichincha,B,6
28507,3029395,2017-08-31,9,POULTRY,1,47.259998,Quito,Pichincha,B,6
28508,3029396,2017-08-31,9,PREPARED FOODS,0,47.259998,Quito,Pichincha,B,6
28509,3029397,2017-08-31,9,PRODUCE,1,47.259998,Quito,Pichincha,B,6
28510,3029398,2017-08-31,9,SCHOOL AND OFFICE SUPPLIES,9,47.259998,Quito,Pichincha,B,6
28511,3029399,2017-08-31,9,SEAFOOD,0,47.259998,Quito,Pichincha,B,6

In [39]:
# Merging of transaction data to the test set based on two similar columns, namely, 'date', and 'store_nbr'
merged_test_dataset = merged_test_data2.merge(transaction_data, on=['date', 'store_nbr'], how='left')

#Preview of changes made to training data
merged_test_dataset.tail(10)

,id,date,store_nbr,family,onpromotion,dcoilwtico,city,state,type,cluster,transactions
28502,3029390,2017-08-31,9,MAGAZINES,0,47.259998,Quito,Pichincha,B,6,NaN
28503,3029391,2017-08-31,9,MEATS,20,47.259998,Quito,Pichincha,B,6,NaN
28504,3029392,2017-08-31,9,PERSONAL CARE,14,47.259998,Quito,Pichincha,B,6,NaN
28505,3029393,2017-08-31,9,PET SUPPLIES,0,47.259998,Quito,Pichincha,B,6,NaN
28506,3029394,2017-08-31,9,PLAYERS AND ELECTRONICS,0,47.259998,Quito,Pichincha,B,6,NaN
28507,3029395,2017-08-31,9,POULTRY,1,47.259998,Quito,Pichincha,B,6,NaN
28508,3029396,2017-08-31,9,PREPARED FOODS,0,47.259998,Quito,Pichincha,B,6,NaN
28509,3029397,2017-08-31,9,PRODUCE,1,47.259998,Quito,Pichincha,B,6,NaN
28510,3029398,2017-08-31,9,SCHOOL AND OFFICE SUPPLIES,9,47.259998,Quito,Pichincha,B,6,NaN
28511,3029399,2017-08-31,9,SEAFOOD,0,47.259998,Quito,Pichincha,B,6,NaN

### EDA: Explaratory Data Analysis

EDA on training set

In [40]:
#Preview on information summary on modified merged dataset
merged_train_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000888 entries, 0 to 3000887
Data columns (total 12 columns):
 #   Column        Dtype
---  ------        -----
 0   id            int64
 1   date          datetime64[ns]
 2   store_nbr     int64
 3   family        object
 4   sales         float64
 5   onpromotion   int64
 6   dcoilwtico    float64
 7   city          object
 8   state         object
 9   type          object
 10  cluster       int64
 11  transactions  float64
dtypes: datetime64[ns](1), float64(3), int64(4), object(4)
memory usage: 274.7+ MB

In [41]:
#Summary of numerical description on modified training data
merged_train_dataset.describe()

,id,date,store_nbr,sales,onpromotion,dcoilwtico,cluster,transactions
count,3.000888e+06,3000888,3.000888e+06,3.000888e+06,3.000888e+06,2.072466e+06,3.000888e+06,2.755104e+06
mean,1.500444e+06,2015-04-24 08:27:04.703088384,2.750000e+01,3.577757e+02,2.602770e+00,6.792559e+01,8.481481e+00,1.694602e+03
min,0.000000e+00,2013-01-01 00:00:00,1.000000e+00,0.000000e+00,0.000000e+00,2.619000e+01,1.000000e+00,5.000000e+00
25%,7.502218e+05,2014-02-26 18:00:00,1.400000e+01,0.000000e+00,0.000000e+00,4.638000e+01,4.000000e+00,1.046000e+03
50%,1.500444e+06,2015-04-24 12:00:00,2.750000e+01,1.100000e+01,0.000000e+00,5.333000e+01,8.500000e+00,1.393000e+03
75%,2.250665e+06,2016-06-19 06:00:00,4.100000e+01,1.958473e+02,0.000000e+00,9.580000e+01,1.300000e+01,2.079000e+03
max,3.000887e+06,2017-08-15 00:00:00,5.400000e+01,1.247170e+05,7.410000e+02,1.106200e+02,1.700000e+01,8.359000e+03
std,8.662819e+05,NaN,1.558579e+01,1.101998e+03,1.221888e+01,2.566633e+01,4.649735e+00,9.632810e+02

In [42]:
#Check of missing values in modified train data set
print('Missing values in train dataset')
print('**' * 16)
for column in merged_train_dataset.columns:
    missin_vals = merged_train_dataset[column].isna().sum()
    print()
    print(f'Sum of missing values in column {column}: {missin_vals}')

Missing values in train dataset
********************************

Sum of missing values in column id: 0

Sum of missing values in column date: 0

Sum of missing values in column store_nbr: 0

Sum of missing values in column family: 0

Sum of missing values in column sales: 0

Sum of missing values in column onpromotion: 0

Sum of missing values in column dcoilwtico: 928422

Sum of missing values in column city: 0

Sum of missing values in column state: 0

Sum of missing values in column type: 0

Sum of missing values in column cluster: 0

Sum of missing values in column transactions: 245784